# GetNumberOfTreads Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..GetNumberOfTreads Method
IFCLegacyStairOrRamp Class See Also
---
Gets the number of treads.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<int> GetNumberOfTreads()
```

Visual Basic
---
```text
Public Function GetNumberOfTreads As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetNumberOfTreads()
```

# ### Return Value
The list of numbers of treads.
# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace